src/InformationRegisters/СтруктураИерархииПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтруктураИерархииПодразделений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СтруктураИерархииПодразделений/Ext/ManagerModule.bsl
// Модуль менеджера регистра "Структура иерархии подразделений"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ИНИЦИАЛИЗАЦИИ СЛУЖЕБНЫХ РЕКВИЗИТОВ

Функция ПолучитьТаблицыИерархии(Запрос, Уровень = 0)

	Запрос.Текст = "ВЫБРАТЬ
	|	ТабПодразделений.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ВЫРАЗИТЬ(ТабПодразделений.Группа КАК Справочник.ПодразделенияКомпании).Родитель КАК Группа
	|ПОМЕСТИТЬ
	|	Уровень"+Формат(Уровень, "ЧГ=0")+"
	|ИЗ
	|	Уровень"+Формат(Уровень-1, "ЧН=0; ЧГ=0")+" КАК ТабПодразделений
	|ГДЕ
	|	(НЕ ВЫРАЗИТЬ(ТабПодразделений.Группа КАК Справочник.ПодразделенияКомпании).Родитель = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка))";
	
	Если Запрос.Выполнить().Выгрузить()[0].Количество=0 Тогда
		КоличествоУровней = Уровень-1;
	Иначе
		КоличествоУровней = ПолучитьТаблицыИерархии(Запрос, Уровень+1);
	КонецЕсли;
	
	Возврат КоличествоУровней;
	
КонецФункции

Функция ПолучитьТекстТаблицыИерархии(ПодразделениеКомпании, Запрос)
	
	Если ПодразделениеКомпании = Неопределено Тогда
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ПодразделенияКомпании.Ссылка КАК ПодразделениеКомпании,
		|	ПодразделенияКомпании.Ссылка КАК Группа
		|ПОМЕСТИТЬ
		|	Уровень1
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|";
	Иначе
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ПодразделенияКомпании.Ссылка КАК ПодразделениеКомпании,
		|	ПодразделенияКомпании.Ссылка КАК Группа
		|ПОМЕСТИТЬ
		|	Уровень1
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	ПодразделенияКомпании.Ссылка В ИЕРАРХИИ (&ПодразделениеКомпании)
		|";
		Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	КонецЕсли;
	
	Если Запрос.Выполнить().Выгрузить()[0].Количество = 0 Тогда
		КоличествоУровней = 0;
	Иначе
		КоличествоУровней = ПолучитьТаблицыИерархии(Запрос, 2);
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТабПодразделений.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ТабПодразделений.Группа КАК Группа,
	|	1 КАК Уровень
	|ПОМЕСТИТЬ
	|	ТабСправочника
	|ИЗ
	|	Уровень1 КАК ТабПодразделений";
	
	ТекстЗапросаУдаленияТаблиц = "";
	Для Итерация = 1 По КоличествоУровней Цикл
		
		ТекстУровень = Формат(Итерация+1,"ЧЦ=3; ЧДЦ=0; ЧН=0; ЧГ=0");
		
		ТекстЗапроса = ТекстЗапроса + "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТабПодразделений.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|	ТабПодразделений.Группа КАК Группа,
		|	" + ТекстУровень + " КАК Уровень
		|ИЗ
		|	Уровень" + ТекстУровень + " КАК ТабПодразделений";
		
		ТекстЗапросаУдаленияТаблиц = ТекстЗапросаУдаленияТаблиц + "
		|УНИЧТОЖИТЬ
		|	Уровень" + ТекстУровень+"
		|;
		|";
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + ";
	|
	|УНИЧТОЖИТЬ
	|	Уровень1
	|;
	|" + ТекстЗапросаУдаленияТаблиц + "
	|ВЫБРАТЬ
	|	ТабСправочника.ПодразделениеКомпании,
	|	МАКСИМУМ(ТабСправочника.Уровень) КАК Уровень
	|ПОМЕСТИТЬ
	|	ТабУровенейЭлементов
	|ИЗ
	|	ТабСправочника КАК ТабСправочника
	|СГРУППИРОВАТЬ ПО
	|	ТабСправочника.ПодразделениеКомпании
	|;
	|
	|ВЫБРАТЬ
	|	ТабСправочника.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ТабСправочника.Группа КАК Группа,
	|	ТабСправочника.Уровень КАК Порядок,
	|	ТабУровенейЭлементов.Уровень-ТабСправочника.Уровень КАК Уровень
	|ИЗ	
	|	ТабСправочника КАК ТабСправочника
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТабУровенейЭлементов КАК ТабУровенейЭлементов
	|ПО
	|	ТабСправочника.ПодразделениеКомпании = ТабУровенейЭлементов.ПодразделениеКомпании
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ОбновитьСтруктуруИерархииПодразделений(ПодразделениеКомпании = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если ПодразделениеКомпании = Неопределено Тогда
		НаборЗаписей = РегистрыСведений.СтруктураИерархииПодразделений.СоздатьНаборЗаписей();
		НаборЗаписей.Записать(Истина);
	Иначе
		
		// Удалить все записи для текущего элемента
		НаборЗаписей = РегистрыСведений.СтруктураИерархииПодразделений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПодразделениеКомпании.Установить(ПодразделениеКомпании);
		НаборЗаписей.Записать(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтруктураИерархииПодразделений.ПодразделениеКомпании
		|ИЗ
		|	РегистрСведений.СтруктураИерархииПодразделений КАК СтруктураИерархииПодразделений
		|ГДЕ
		|	СтруктураИерархииПодразделений.Группа = &ПодразделениеКомпании
		|";
		
		Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			// Удалить все записи для вложенного элемента
			НаборЗаписей = РегистрыСведений.СтруктураИерархииПодразделений.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПодразделениеКомпании.Установить(Выборка.ПодразделениеКомпании);
			НаборЗаписей.Записать(Истина);
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТекстЗапроса = ПолучитьТекстТаблицыИерархии(ПодразделениеКомпании, Запрос);
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяЗапись = РегистрыСведений.СтруктураИерархииПодразделений.СоздатьМенеджерЗаписи();
		НоваяЗапись.ПодразделениеКомпании = Выборка.ПодразделениеКомпании;
		НоваяЗапись.Группа                = Выборка.Группа;
		НоваяЗапись.Порядок               = Выборка.Порядок;
		НоваяЗапись.Уровень               = Выборка.Уровень;
		НоваяЗапись.Записать(Истина);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ОбновитьСтруктуруИерархииПодразделений()

// Обновляет вспомогательные данные, которые зависят от конфигурации частично.
//
// Обновляется при наличии изменений конфигурации, записанных в параметры
// ограничения доступа при обновлении базы данных на текущую версию конфигурации.
//
Процедура ОбновитьСтруктуруИерархии() Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СтруктураИерархииПодразделений");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		ОбновитьСтруктуруИерархииПодразделений();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьРодителейПодразделения(ПодразделениеКомпании) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтруктураИерархииПодразделений.Группа КАК Группа
	               |ИЗ
	               |	РегистрСведений.СтруктураИерархииПодразделений КАК СтруктураИерархииПодразделений
	               |ГДЕ
	               |	СтруктураИерархииПодразделений.ПодразделениеКомпании = &ПодразделениеКомпании";
	Запрос.УстановитьПараметр("ПодразделениеКомпании",ПодразделениеКомпании);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьРодителейПодразделения()

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты регистра
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
